Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: The buffer must contain sufficient memory to accommodate source.underestimatedCount.
ja: バッファは、source.underestimatedCountを収容するのに十分なメモリを含んでいなければなりません。

source: The buffer pointer plus offset must be properly aligned for accessing an instance of type T.
ja: offsetを加えたバッファポインタは、型Tのインスタンスにアクセスするために適切にアラインされる必要があります。

source: The buffer slice to rebase.
ja: 再構築されるバッファスライス。

source: The buffer to convert.
ja: 変換されることになるバッファ。

source: The buffer’s memory must be initialized or the buffer’s Element must be a trivial type.
ja: バッファのもつメモリは初期化されなければなりません、またバッファのもつElementは自明型でなければなりません。

source: The buffer’s type T must be a trivial type.
ja: バッファのもつ型Tは、自明型でなければなりません。

source: The bytes for a are copied from the first four bytes of someBytes, and the bytes for b are copied from the next four bytes.
ja: aに対するバイトは、someBytesの最初の４バイトからコピーされます、そしてbに対するバイトは次の４バイトからコピーされます。

source: The canonical combining class of the scalar.
ja: このスカラーの正準結合クラス。

source: The case-sensitive comparison will only match strings whose corresponding characters have the same case.
ja: 大文字小文字考慮での比較は、対応する文字の大文字小文字が同じである文字列同士のみが一致することになります。

source: The character at that position is the composed "é" character.
ja: その位置での文字は、合成済"é"文字です。

source: The character that was removed.
ja: 削除された文字。

source: The character to append to the string.
ja: 文字列に追加されることになる文字。

source: The character to convert to a string.
ja: ある文字列へと変換されることになる文字。

source: The character to repeat.
ja: 繰り返すことになる文字。

source: The classification of a scalar used in the Canonical Ordering Algorithm defined by the Unicode Standard.
ja: 「Unicode標準」によって定義される「正準順序アルゴリズム」において使われるあるスカラーのクラス分け。

source: The closure is called again repeatedly with the previous call’s return value and each element of the sequence.
ja: クロージャは、前の呼び出しの戻り値とシーケンスの各要素とともに繰り返して再び呼び出されます。

source: The closure is called again repeatedly with the updated accumulating value and each element of the sequence.
ja: クロージャは、更新された蓄積値とシーケンスの各要素とともに繰り返して再び呼び出されます。

source: The closure provided to the compactMap(_:) method takes each Int and looks up a corresponding String from a romanNumeralDict dictionary.
ja: compactMap(_:)メソッドに提供されたクロージャは、各Intをとり、そして対応しているStringをromanNumeralDict辞書から捜します。

source: The closure provided to the map(_:) method takes each Int and looks up a corresponding String from a romanNumeralDict dictionary.
ja: map(_:)メソッドに提供されたクロージャは、各Intをとり、そして対応しているStringをromanNumeralDict辞書から捜します。

source: The closure should return the number of initialized code units, or 0 if it couldn’t initialize the buffer (for example if the requested capacity was too small).
ja: クロージャは、初期化されたコード単位の数を返すべきです、または０をもしそれがバッファを初期化することができなかったならば（例えば要請された収容能力が小さすぎたならば）。

source: The closure’s buffer argument is valid only for the duration of the closure’s execution.
ja: クロージャのもつバッファ引数は、このクロージャの実行の間に対してだけ有効です。

source: The closure’s pointer argument is valid only for the duration of the closure’s execution.
ja: クロージャのもつポインタ引数は、このクロージャの実行の間に対してだけ有効です。

source: The code above stores the value 0xFFFF_FFFF into the four newly allocated bytes, and then loads the first byte as a UInt8 instance and the third and fourth bytes as a UInt16 instance.
ja: 上のコードは値0xFFFF_FFFFを４つの新しいアロケート済みバイトに格納して、それから最初のバイトをUInt8インスタンスとして、そして３番目と４番目のバイトをUInt16インスタンスとしてロードします。

source: The code point to use for the scalar.
ja: このスカラーのために使うコード点。

source: The code units of that buffer match the code units in the string’s utf8 view.
ja: このバッファのコード単位は、文字列のもつutf8ビューでのコード単位と一致します。

source: The collection being appended to allocates any additional necessary storage to hold the new elements.
ja: コレクションは追加されることによって、新しい要素を保有するために何らかの追加的に必要なストレージを割り当てます。

source: The collection must not be empty.
ja: コレクションは空であってはなりません。

source: The collection to create a view into.
ja: それに対してビューが作成されることになるコレクション。

source: The collection’s “past the end” position—that is, the position one greater than the last valid subscript argument.
ja: コレクションの「終わりを過ぎた」位置—すなわち、最後の有効な添え字引数より１つ大きい位置。

source: The combining classes of these scalars have the numeric values 0, 230, and 220, respectively.
ja: これらのスカラーの結合クラスは、数値 0、230、そして220をそれぞれ持ちます。

source: The comparison is both case sensitive and Unicode safe.
ja: 比較は、大文字小文字考慮のみならずユニコード安全でもあります。

source: The components used for hashing must be the same as the components compared in your type’s == operator implementation.
ja: ハッシュ化に使用される構成要素は、あなたの型のもつ==演算子実装において比較される構成要素と同じでなければなりません。

source: The contents of the interpolation’s parentheses are treated as the call’s argument list.
ja: 補間のもつ丸括弧の内容は、その呼び出しの引数リストとして扱われます。

source: The conversion of p to a string in the assignment to s uses the Point type’s debugDescription property.
ja: pの文字列への変換はsへの代入において、Point型のもつdebugDescriptionプロパティを使います。

source: The conversion of p to a string in the assignment to s uses the Point type’s description property.
ja: sへの代入におけるpの文字列への変換は、Point型のもつdescriptionプロパティを使います。

source: The corresponding value of the raw type.
ja: この生の型の対応している値。

source: The current decoding index of the container (i.e. the index of the next element to be decoded.) Incremented after every successful decode call.
ja: このコンテナの現在のデコーディングインデックス（すなわちデコードされることになる、次の要素のインデックス）。すべての成功したデコード呼び出しの後に増やされます。

source: The current task’s priority.
ja: 現在のタスクのもつ優先度。

source: The custom mirror for this instance.
ja: このインスタンスのためのあつらえのミラー。

source: The decoder to read data from.
ja: それからデータを読み出すデコーダ。

source: The default cancellation thrown when a task is cancelled.
ja: あるタスクが取り消される時にスローされる省略時の取り消し。

source: The default implementation returns 0.
ja: 省略時の実装は、０を返します。

source: The default is 10.
ja: 省略時は10。

source: The default is false.
ja: 初期状態はfalseです。

source: The default is zero.
ja: 初期状態はゼロです。

source: The default separator is an empty string.
ja: 省略時の分離子は空の文字列です。

source: The default type for an otherwise-unconstrained Boolean literal.
ja: ブールリテラルである他は別途制約されない省略時用の型。

source: The default type for an otherwise-unconstrained Unicode extended grapheme cluster literal.
ja: 別途制約されないユニコード拡張書記素クラスタリテラルのための省略時型。

source: The default type for an otherwise-unconstrained floating-point literal.
ja: 別途制約されない浮動小数点リテラルのための省略時型。

source: The default type for an otherwise-unconstrained integer literal.
ja: 別途制約されない整数リテラルのための省略時型。

source: The default type for an otherwise-unconstrained string literal.
ja: 別途制約されない文字列リテラルのための省略時型。

source: The default type for an otherwise-unconstrained unicode scalar literal.
ja: 別途制約されないユニコードスカラーリテラルのための省略時型。

source: The default value is false.
ja: 省略時の値はfalseです。

source: The default value is Int.max.
ja: 省略時の値はInt.maxです。

source: The default value is true.
ja: 省略時の値は、trueです。

source: The default value is returned whenever the task-local is read from a context which either: has no task available to read the value from (e.g. a synchronous function, called without any asynchronous function in its call stack),
ja: 省略時の値は、タスクローカル値がこのどちらかの文脈で読み出される時はいつでも返されます：値をそれから読み出すのに利用可能なタスクがひとつもない（たとえば、それの呼び出しスタックの中にどんな非同期関数もなしに呼び出されるある同期関数）、

source: The deinitialized memory can be reinitialized with values of the same type, bound to a new type, or deallocated.
ja: デイニシャライズされたメモリは、同じ型の値で再初期化する、新しい型に束縛する、またはデアロケートできます。

source: The destination memory must be uninitialized or the buffer’s Element must be a trivial type.
ja: 行き先のメモリは未初期化でなければなりません、またポインタのもつElementは自明型でなければなりません。

source: The destination memory must be uninitialized or the pointer’s Pointee must be a trivial type.
ja: 行き先のメモリは未初期化でなければなりません、またポインタのもつPointeeは自明型でなければなりません。

source: The difference between these states can be distinguished by checking isAtEnd.
ja: これらの状態の間の差は、isAtEnd.

source: The difference needed to produce the receiver’s state from the parameter’s state.
ja: レシーバのもつ状態をパラメータのもつ状態から生成するのに必要とされる差異。

source: The difference needed to produce this collection’s ordered elements from the given collection.
ja: このコレクションのもつ順番付けられた要素をこの与えられたコレクションから生成するのに必要とされる差異。

source: The difference of the two arguments must be representable in the arguments’ type.
ja: ２つの引数の差は、引数の持つ型において表現可能でなければなりません。

source: The difference to be applied.
ja: 適用されることになる差異。

source: The distance between start and end.
ja: startとendの隔たり。

source: The distance from this pointer to end, in strides of the pointer’s Pointee type.
ja: このポインタからendまでの隔たり、ポインタのもつPointee型のストライドで。

source: The distance from this value to other.
ja: この値からotherまでの隔たり。

source: The distance to advance this value.
ja: この値を前進させる距離。

source: The distance to offset i.
ja: iを補う間隔。

source: The earliest version of the Unicode Standard in which the scalar was assigned.
ja: それにおいてこのスカラーが割り当てられた「ユニコード標準」の最も時期の早いバージョン。

source: The element that should be split upon.
ja: それで分離されることになる要素。

source: The element to append to the collection.
ja: この要素をコレクションへ追加します。

source: The element to find in the asynchronous sequence.
ja: この要素を非同期シーケンスの中で見つけ出します。

source: The element to find in the sequence.
ja: このシーケンスにおいて見つける要素。

source: The element to repeat.
ja: 繰り返される要素。

source: The elements of the utf16 view are the code units for the string when encoded in UTF-16.
ja: utf16ビューの要素は、UTF-16で符号化される時の文字列に対するコード単位です。

source: The elements of the utf8 view are the code units for the string when encoded in UTF-8.
ja: utf8ビューの要素は、UTF-8で符号化される時の文字列に対するコード単位です。

source: The elements of the index vector are wrapped modulo the count of elements in this vector.
ja: インデックスベクターの要素は、このベクターの中の要素の数によるモジュロでラップされます。

source: The elements of the result are computed lazily, each time they are read, by calling transform function on a base element.
ja: 結果のそれぞれの要素は遅延に計算されます、毎回それらは、基盤となる要素上でtransform関数を呼び出すことによって読み出されます。

source: The elements of the resulting array are ordered according to the given predicate.
ja: 結果の配列の要素は、与えられた述部にしたがって並べられます。

source: The elements of the sequence are computed lazily and the sequence may potentially be infinite in length.
ja: このシーケンスに属する要素らは、遅延に計算されます、そしてこのシーケンスの長さは潜在的に無限大です。

source: The elements returned by this iterator appear in the order that the tasks completed, not in the order that those tasks were added to the task group.
ja: このイテレータによって返される要素それらは、タスクそれらが完了した順番に現れます、それらタスクがタスクグループに加えられた順番にではなく。

source: The elements returned from this method appear in the order that the tasks completed, not in the order that those tasks were added to the task group.
ja: このメソッドから返される要素それらは、タスクそれらが完了した順番に現れます、それらタスクがタスクグループに加えられた順番にではなく。

source: The elements to append to the collection.
ja: これらの要素をコレクションへ追加します。

source: The elements to use in the vector.
ja: このベクターにおいて使うことになる要素。

source: The encoder to write data to.
ja: データを書き込むエンコーダ。

source: The encoding in which codeUnits should be interpreted.
ja: それでcodeUnitsが解釈されるべきエンコーディング。

source: The encoding in which the code units should be interpreted.
ja: それでコード単位が解釈されるべきエンコーディング。

source: The encoding with which this parser is associated
ja: それとこのパーサーが結びつけられる符号化。

source: The end index refers to the position one past the last element of a collection, so it doesn’t correspond with an element.
ja: 末尾インデックスは、あるコレクションの最後の要素を１つ過ぎた位置を参照します、それでそれはある要素に対応しません。

source: The entire region of memory referenced by this buffer must be initialized.
ja: このバッファによって参照されるメモリの全領域は、初期化されなければなりません。

source: The error is always an instance of Task.CancellationError.
ja: エラーは常にTask.CancellationErrorのインスタンスです。

source: The error to throw from an awaiting call to next.
ja: 次への待機している呼び出しからスローすることになるエラー。

source: The error to throw from the continuation.
ja: その継続からスローされたエラー。

source: The exact semantics of how priority is treated are left up to each platform and Executor implementation.
ja: どのように優先度が扱われるかの正確な意味論は、それぞれのプラットホームとExecutor実装に任されます。

source: The example below defines a Person class, creates two instances of it, and uses several #keyPath string expressions to access properties and properties of those properties:
ja: 下の例は、Personクラスを定義して、それの２つのインスタンスを作成して、そしていくつかの#keyPath文字列式を使っていくつかのプロパティおよびそれらプロパティのプロパティにアクセスします：

source: The example below shows a selector being used as part of the target-action pattern to call a method in response to the touchUpInside event.
ja: 下の例は、ターゲットアクションパターンの一部として使われるセレクタを示して、あるメソッドをtouchUpInsideメソッドに答えて呼び出します。

source: The example below uses two strings with different forms of the "é" character—the first uses the composed form and the second uses the decomposed form.
ja: 以下の例は、異なる形式の"é"文字を持つ２つの文字列を使います—最初は合成形式を使い、そして２番目は分解形式を使います。

source: The file path be interpreted as UTF-8.
ja: このファイルパスはUTF-8として解釈されます。

source: The file path to be interpreted as UTF-8.
ja: UTF-8として解釈することになるファイルパス。

source: The final accumulated value.
ja: 最終的に蓄積された値。

source: The final example passes false for the omittingEmptySubsequences parameter, so the returned array contains empty strings where spaces were repeated.
ja: 最後の例はfalseをomittingEmptySubsequencesパラメータに渡します、なので返される配列は空白が繰り返されたところで空の文字列を含みます。

source: The final example passes true for the allowEmptySlices parameter, so the returned array contains empty strings where spaces were repeated.
ja: 最後の例はtrueをallowEmptySlicesパラメータに渡します、なので返される配列は空白が繰り返されたところで空の文字列を含みます。

source: The final result is true because the ASCII digits have non-default emoji presentations; some platforms render these with an alternate appearance.
ja: 最後の結果はtrueです、なぜならASCII桁それらは非初期状態emoji表現を持つので；いくつかのプラットホームはそれらは代替の外観で描出します。

source: The first and second code units of the pair, designated leading and trailing surrogates, make up a surrogate pair.
ja: このペアの最初と２番目のコード単位、先行および後続サロゲートと呼ばれるものが、ひとつのサロゲートペアを作り上げます。

source: The first code unit is designated a lead byte and the rest are continuation bytes.
ja: 最初のコード単位は、先行バイトに指定されます、そして残りは継続バイトです。

source: The first element of the collection if the collection is not empty; otherwise, nil.
ja: コレクションが空でないならばコレクションの最初の要素；そうでなければnil。

source: The first element of the collection.
ja: コレクションの最初の要素。

source: The first element of the sequence that satisfies predicate, or nil if there is no element that satisfies predicate.
ja: predicate満たすシーケンスの最初の要素、またはpredicateを満たす要素が無いならばnil。

source: The first in any sequence of mutating operations causes elements to be copied into unique, contiguous storage which may cost O(n) time and space, where n is the length of the string’s encoded representation (or more, if the underlying NSString has unusual performance characteristics).
ja: 何らかの変更を行う一連の演算の中の最初のものは、要素が固有の、隣接するストレージへとコピーされる原因となり、それはO(n)の時間と空間がかかります、そこにおいてnは文字列表現の長さです（またはそれ以上のもの、基盤となるNSStringが通常でない性能特質を持つならば）。

source: The first index where element is found.
ja: elementが見つけられたところの最初のインデックス。

source: The first partition, numbers[..<p], is made up of the elements that are not greater than 30.
ja: 最初の区画、numbers[..<p]は、30より大きくない要素から構成されます。

source: The first use of split returns each word that was originally separated by one or more spaces.
ja: splitの最初の利用は、各単語を返します、それはもともと１つ以上の空白で隔てられています。

source: The first value to add.
ja: 加算する第１の値。

source: The first value to multiply.
ja: 掛け合わされる第１の値。

source: The following code creates slice, a slice covering part of an existing buffer instance, then rebases it into a new rebased buffer.
ja: 以下のコードはslice、既存のバッファインスタンスの一部をカバーするスライス、を作成します、それからそれを新しい生のrebasedバッファへと再構築します。

source: The following code creates constants for the first and second positions in the flag.utf8 view.
ja: 以下のコードは、flag.utf8ビューの中の１番目と２番目の位置に対する定数それぞれを作成します。

source: The following code declares a generic version of the parseAndAddOne(_:) function:
ja: 以下のコードは、parseAndAddOne(_:)関数のひとつの総称体版を宣言します：

source: The following code encodes a fermata in UTF-16:
ja: 以下のコードは、フェルマータをUTF-16でエンコードします：

source: The following code encodes a fermata in UTF-32:
ja: 以下のコードは、フェルマータをUTF-32でエンコードします：

source: The following code encodes a fermata in UTF-8:
ja: 以下のコードはフェルマータをUTF-8でエンコードします：

source: The following code temporarily rebinds the memory that uint8Pointer references from UInt8 to Int8 to call the imported C strlen function.
ja: 以下のコードは、一時的にuint8Pointerが参照するメモリをUInt8からInt8へと再束縛することで、インポートされたC strlen関数を呼び出します。

source: The following code tests whether a string contains any math symbols:
ja: 以下のコードは、ある文字列が何らかの数学記号を含むかどうかをテストします：

source: The following code uses the UTF8 codec to encode a fermata in UTF-8:
ja: 以下のコードは、UTF8コーデックを使ってUTF-8でのフェルマータをエンコードします：

source: The following code uses this method to test whether all the names in an array have at least five characters:
ja: 以下のコードは、このメソッドを使って、配列の中の全ての名前が少なくとも５つの文字を含むかどうかを試験します：

source: The following example accesses an element of an array through its subscript to print its value:
ja: 以下の例は、配列のある要素にそれの添え字によってアクセスしてそれの値を出力します。

source: The following example accesses the fourth code unit in both the flowers and nsflowers strings:
ja: 以下の例は、flowersとnsflowers文字列の両方で４番目のコード単位にアクセスします：

source: The following example adds a new number to an array of integers:
ja: 次の例は、ある新しい要素を整数からなる配列へ加えます：

source: The following example adds an emoji globe to the end of a string.
ja: 以下の例は地球絵文字をある文字列の終わりに加えます。

source: The following example allocates a buffer that can store four Int instances and then initializes that memory with the elements of a range:
ja: 以下の例は、４つのIntインスタンスを格納できるあるバッファをアロケートして、それからそのメモリをある範囲に属するいくらかの要素で初期化します。

source: The following example allocates enough new memory to store four Int instances and then initializes that memory with the elements of a range.
ja: 以下の例は、新しいメモリを必要なだけアロケートすることで、４つのIntインスタンスを格納して、それからそのメモリをある範囲に属するいくらかの要素で初期化します。

source: The following example allocates enough raw memory to hold four instances of Int8, and then uses the initializeMemory(as:from:count:) method to initialize the allocated memory.
ja: 以下の例は、生のメモリを必要なだけアロケートすることで、４つのInt8インスタンスを保持して、それからinitializeMemory(as:from:count:)メソッドを使ってアロケートされたメモリを初期化します。

source: The following example allocates enough raw memory to hold four instances of Int8, and then uses the initializeMemory(as:repeating:count:) method to initialize the allocated memory.
ja: 以下の例は、生のメモリを必要なだけアロケートすることで、４つのInt8インスタンスを保持して、それからinitializeMemory(as:repeating:count:)メソッドを使ってアロケートされたメモリを初期化します。

source: The following example allocates four bytes of memory and stores 0xFF in all four bytes:
ja: 以下の例は、４バイトのメモリをアロケートして0xFFを４バイトすべての中に格納します：

source: The following example appends the elements of a Range<Int> instance to an array of integers:
ja: 次の例は、Range<Int>インスタンスからなるいくらかの要素を整数からなる配列に追加します：

source: The following example binds the memory referenced by uint8Pointer to one instance of the UInt64 type:
ja: 以下の例は、uint8Pointerによって参照されるメモリをUInt64型のあるインスタンスに束縛します：

source: The following example builds a customized greeting by using the append(_:) method:
ja: 以下の例はあつらえの挨拶をappend(_:)メソッドを使うことによって作ります：

source: The following example calls this initializer with pointers to the contents of two different CChar arrays—the first with well-formed UTF-8 code unit sequences and the second with an ill-formed sequence at the end.
ja: 以下の例は、このイニシャライザを２つの異なるCChar配列の内容へのポインタとともに呼び出します—最初のものは正しい形式のUTF-8コード単位シーケンスをもち、そして２番目のものはある誤形式シーケンスを末尾に保ちます。

source: The following example calls this method with pointers to the contents of two different CChar arrays—the first with well-formed UTF-8 code unit sequences and the second with an ill-formed sequence at the end.
ja: 以下の例は、このメソッドを２つの異なるCChar配列の内容へのポインタとともに呼び出します—最初のものは正しい形式のUTF-8コード単位シーケンスをもち、そして２番目のものはある誤形式シーケンスを末尾に保ちます。

source: The following example converts the maximal Int value to a string and prints its length:
ja: 以下の例は、最大限のInt値を文字列へ変換してそれの長さを出力します：

source: The following example converts the position of the Unicode scalar "e" into its corresponding position in the string.
ja: 以下の例は、ユニコードスカラー"e"の位置を文字列でのそれの対応位置に変換します。

source: The following example creates a greeting string, and then finds the substring of the first sentence:
ja: 以下の例は、greeting文字列を作成して、それから第一文からなる下位文字列を見つけます。

source: The following example creates an array initialized with five strings containing the letter Z.
ja: 以下の例は、字Zを含んでいる５つの文字列で初期化される配列を作成します。

source: The following example creates two new Int32 instances from the memory referenced by the buffer pointer someBytes.
ja: 以下の例は、２つの新しいInt32インスタンスをバッファポインタsomeBytesによって参照されるメモリから作成します。

source: The following example declares singleDigits, a range of single digit integers, and then drops the first element to create a slice of that range, singleNonZeroDigits.
ja: 以下の例は、１桁整数からなる範囲、singleDigitsを宣言します、それから最初の要素を落としてその範囲のあるスライス、singleNonZeroDigitsを作成します。

source: The following example decodes the UTF-16 encoded bytes of a string into an array of Unicode.Scalar instances.
ja: 以下の例は、ある文字列のUTF-16エンコードされたバイトを、Unicode.Scalarインスタンスの配列へとデコードします。

source: The following example decodes the UTF-8 encoded bytes of a string into an array of Unicode.Scalar instances.
ja: 以下の例は、ある文字列のUTF-8エンコードされたバイトを、Unicode.Scalarインスタンスの配列へとデコードします。

source: The following example decodes the UTF-8 encoded bytes of a string into an array of Unicode.Scalar instances:
ja: 以下の例は、ある文字列のUTF-8エンコードされたバイトを、Unicode.Scalarインスタンスの配列へとデコードします：

source: The following example defines x as an instance of UInt8, an 8-bit, unsigned integer type.
ja: 以下の例は、xをUInt8のインスタンス、ある８ビットの、符号なし整数型として定義します。

source: The following example finds the length of the UTF-16 encoding of the string "Fermata 𝄐", starting with its UTF-8 representation.
ja: 以下の例は、文字列"Fermata 𝄐"のUTF-16エンコーディングの長さを、それのUTF-8表現で開始して見つけます。

source: The following example finds the position of a space in a string and then converts that position to an index in the string’s utf16 view.
ja: 以下の例は、ある空白の位置を文字列の中で見つけて、それからその位置を文字列のもつutf16ビューの中のインデックスに変換します。

source: The following example finds the position of a space in a string’s utf16 view and then converts that position to an index in the string’s unicodeScalars view:
ja: 以下の例は、ある空白の位置を文字列のもつutf16ビューの中で見つけて、それからその位置を文字列のもつunicodeScalarsビューの中のインデックスに変換します。

source: The following example finds the position of a space in a string’s utf16 view and then converts that position to an index in the string’s utf8 view.
ja: 以下の例は、ある空白の位置を文字列のもつutf16ビューの中で見つけて、それからその位置を文字列のもつutf8ビューの中のインデックスに変換します。

source: The following example obtains an index advanced four positions from a string’s starting index and then prints the character at that position.
ja: 以下の例は、文字列の開始インデックスから４位置進んだインデックスを取得して、それからその位置の文字を出力します。

source: The following example obtains an index advanced four positions from an array’s starting index and then prints the element at that position.
ja: 以下の例は、配列の始まりから４位置進んだインデックスを入手して、それからその位置での要素を出力します。

source: The following example passes a pointer to the value variable by using inout syntax:
ja: 以下の例は、value変数へのポインタをinout構文を使って渡します：

source: The following example reverses the elements of an array of characters:
ja: 以下の例は、文字列からなる配列の要素を逆順にします：

source: The following example searches a string’s Unicode scalars view for a capital letter and then prints the character and Unicode scalar value at the found index:
ja: 以下の例は、ある文字列のもつユニコートスカラービューで大文字を捜して、それから見つかったインデックスでの文字とユニコードスカラー値を出力します：

source: The following example searches for the index of the number 40 in an array of integers, and then prints the suffix of the array starting at that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスで始まる配列の末尾を出力します。

source: The following example searches for the index of the number 40 in an array of integers, and then prints the prefix of the array up to, and including, that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスに至るまでの、そしてそれを含めて、配列の冒頭を出力します。

source: The following example searches for the index of the number 40 in an array of integers, and then prints the prefix of the array up to, but not including, that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスに至るまでの、しかしそれを含めずに、配列の冒頭を出力します。

source: The following example shows how an array of strings can be joined to a single, comma-separated string:
ja: 以下の例は、どのように文字列からなる配列が単一の、コンマ区切りの文字列へと連結できるかを示します：

source: The following example shows how an iterator can be used explicitly to emulate a for-in loop.
ja: 次の例は、イテレータが明示的に使われてfor-inループの機能を真似る方法を示します。
